dev/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-05 seg 10:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Página dos devs da subathon do 61</title>
<meta name="generator" content="Org Mode" />
<base target="_blank" />
<link rel="stylesheet" type="text/css" href="meiaum.css"/>

          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>
        
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />
        
        
        
        
          
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>
        
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />
        
        
        
        
          
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>
        
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />
        
        
        
        
</head>
<body>
<div id="content" class="content">
<h1 class="title">Página dos devs da subathon do 61
<br />
<span class="subtitle">é isso ai <a href="https://www.twitch.tv/omeiaum">=m</a></span>
</h1>
<div id="outline-container-orgf4e4fc5" class="outline-2">
<h2 id="orgf4e4fc5">coisas já funcionando</h2>
<div class="outline-text-2" id="text-orgf4e4fc5">
<ul class="org-ul">
<li><a href="https://tilde.town/~sekva/meiaum/">Conta Engraçada™</a></li>
<li><a href="https://www.lexpdev.xyz/subathon/">Barra de progresso</a></li>
<li><a href="https://subathon.meuportifa.com">Calculadora de quanto falta</a></li>
<li><a href="https://sites.google.com/view/timerprapiscar">Timer pra piscar</a></li>
</ul>
</div>
</div>
<div id="outline-container-org2d6c064" class="outline-2">
<h2 id="org2d6c064">ideias para próximos projetos</h2>
<div class="outline-text-2" id="text-org2d6c064">
</div>
<div id="outline-container-orgb77464f" class="outline-3">
<h3 id="orgb77464f">times de comentaristas do chat [jovt_]</h3>
<div class="outline-text-3" id="text-orgb77464f">
<details class="code-details"
                 style ="padding: 1em;
                          background-color: #e5f5e5;
                          border-radius: 15px;
                          color: hsl(157 75%);
                          font-size: 0.9em;
                          box-shadow: 0.05em 0.1em 5px 0.01em  #00000057;">
                  <summary>
                    <strong>
                      <font face="Courier" size="3" color="#515151">
                         TLDR
                      </font>
                    </strong>
                  </summary>
<p>
tem times no chat, cada um do chat entra num time, o time que mais falar ganha
</p>


</details>

<p>
A ideia é criar grupos no chat e incentivar comentários. No fim da live é anunciado qual o pódio com os times que mais comentaram.
</p>
</div>
<div id="outline-container-org2d593ad" class="outline-4">
<h4 id="org2d593ad">Criação de times</h4>
<div class="outline-text-4" id="text-org2d593ad">
<p>
O chat pode criar times nomeados (facções) com o comando:
</p>
<ul class="org-ul">
<li>!criartime &lt;nome do time&gt;</li>
</ul>

<p>
Ao criar o time, o usuário é automaticamente colocado nesse time.
</p>
</div>
</div>
<div id="outline-container-org1ef0e71" class="outline-4">
<h4 id="org1ef0e71">Entrando e saindo de times</h4>
<div class="outline-text-4" id="text-org1ef0e71">
<p>
Um user pode entrar num time com:
</p>
<ul class="org-ul">
<li>!entrarnotime &lt;nome do time&gt;</li>
</ul>

<p>
Sair do time:
</p>
<ul class="org-ul">
<li>!sairdotime</li>
</ul>

<p>
Melhor não ter como consultar o time (pode induzir spam). O liver vai ter uma telinha mostrando os times, quem faz parte dos time (incluindo o total de participantes dele), e a pontuação de cada time.
</p>
</div>
</div>
<div id="outline-container-org04bea84" class="outline-4">
<h4 id="org04bea84">Funcionamento</h4>
<div class="outline-text-4" id="text-org04bea84">
<p>
No inicio da live, o liver abre um programa que monitora o chat. A cada comentário, o programa:
</p>
<ul class="org-ul">
<li>Pega o nick do usuário</li>
<li>Verifica se é algum comando</li>
<li>Caso não seja um comando, é verificado se o user que comentou pertence a um time, se sim, somasse um no score do time, se não, o comentário é ignorado</li>
<li>Caso seja um comando, interprete-o</li>
<li>Ao fim da live, é anunciado o placar</li>
</ul>
</div>
<div id="outline-container-org37591d1" class="outline-5">
<h5 id="org37591d1">Gerenciamento dos times</h5>
<div class="outline-text-5" id="text-org37591d1">
<p>
O liver pode excluir times como bem entender, já que né&#x2026;
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgef2f1a3" class="outline-3">
<h3 id="orgef2f1a3">sistema de concurso de musica (mata-mata) com votação pelo chat [Enigma Hall]</h3>
<div class="outline-text-3" id="text-orgef2f1a3">
<details class="code-details"
                 style ="padding: 1em;
                          background-color: #e5f5e5;
                          border-radius: 15px;
                          color: hsl(157 75%);
                          font-size: 0.9em;
                          box-shadow: 0.05em 0.1em 5px 0.01em  #00000057;">
                  <summary>
                    <strong>
                      <font face="Courier" size="3" color="#515151">
                         TLDR
                      </font>
                    </strong>
                  </summary>
<p>
de tempos em tempos tem uma &ldquo;fight&rdquo; entre duas musicas
</p>


</details>

<p>
Estamos fazendo um evento de música que todo mundo pode participar, você vai escolher um clipe de música no youtube para te representar em uma batalha musical que elegerá a melhor música do chat. Se duas ou mais pessoas escolherem a mesma música, estarão fora da competição.
</p>

<p>
Os sobreviventes que tiverem músicas únicas serão colocados em categorias e a cada dia o meia um jogará um categoria na live onde assistirá de dois em dois clipes escolhendo o melhor até que um vença todos.
</p>
</div>
<div id="outline-container-org7624e47" class="outline-4">
<h4 id="org7624e47">Categorias</h4>
<div class="outline-text-4" id="text-org7624e47">
<p>
Batidão: Aquelas músicas que você ouve e é difícil ficar parado. As subcategorias são Batidão Banger que
faz você reagir no ritmo e Batidão Clássico que te coloca em uma montanha russa de emoções.
</p>

<p>
Profunda: As músicas onde a letra é tão importante que as fazem serem lembradas para sempre. Que tem as
Subcategorias Profunda Divertida que te passam uma mensagem positiva e as Profunda Triste, aquelas que
te comovem e fazem você encarar as dificuldades.
</p>

<p>
Artístico: Os clipes que são obras de arte que você não tem coragem de pular. Subcategorias o Artístico
Belo que é simplesmente lindo de assistir e o Artístico Caótico que pode ter destruição e monstros sendo
impressionantes.
</p>


<p>
Então escolha seu clipe, Sua categoria e subcategoria no formulário abaixo e se ninguém escolher o mesmo, o Meiaum vai assistir o seu clipe na live. Você pode inclusive escrever em poucas palavras o porque escolheu esse clipe.
</p>

<p>
Temos uma ou mais categorias Extra que não podem ser selecionada mas que será usada para alocar o excedente e ajustes podem ser feitos para balancear as categorias. Se você não aparecer na categoria que escolheu, quem sabe você não é um EXTRA?
</p>

<p>
A Final que vai decidir o vencedor acontecerá no mesmo dia da categoria Extra, totalizando 7 dias. Lembrem-se de respeitar as regras da twitch. Se você escolher um clipe que infrinja a regra da plataforma que passe do valor artístico e tenha nudez e violência desnecessária você pode ser banido então escolha com sabedoria.
</p>
</div>
</div>
<div id="outline-container-org833bf60" class="outline-4">
<h4 id="org833bf60">Dados</h4>
<div class="outline-text-4" id="text-org833bf60">
<ul class="org-ul">
<li>Nick do Participante no chat da Twitch: autoexplicativo mas pode ser do discord se for melhor.</li>
<li>Clipe: para o link do vídeo</li>
<li>Categoria: &lt;Selecionável&gt; Batidão Banger, Batidão Clássico, Profunda Divertida, Profunda Triste, Artístico Belo e Artístico Caótico.</li>
<li>Motivo de Escolha: com duas linhas de espaço para a pessoa dizer o porque o clipe dela é especial.</li>
</ul>

<p>
Cabe aos Devs decidirem a melhor forma de fazer isso, se vão usar um site, ou se vão conseguir programar pelo discord, o importante é conseguir reunir isso no banco de dados e depois conseguir extrair e montar as listas por categoria. Após fazer uma média, todos os participantes excedentes são colocados na categoria EXTRA.
</p>

<p>
O mesmo vale para a apresentação do jogo. O programa escolhido que vai aparecer na live deve abrir de dois em dois links de uma categoria e mostrar em baixo do clipe o nome do participante que escolheu e o motivo dele ter escolhido para que o meiaum possa ler e assistir o clipe. Também deve funcionar para colocar o clipe em tela cheia e ter um botão acima de cada clipe que servirá para definir o vencedor.
</p>
</div>
</div>
<div id="outline-container-org74456dc" class="outline-4">
<h4 id="org74456dc">Dev</h4>
<div class="outline-text-4" id="text-org74456dc">
<p>
Com as parte até aqui programadas e funcionando, terá informação suficiente para saber quantos clipes tem por categoria e ter uma boa ideia do tempo mínimo que irá levar para assistir todos.
</p>

<p>
Após assistir os dois clipes o Meiaum diz o seu preferido e abre uma enquete de 30 segundos, o voto dele vale 25% então o chat ainda tem chance de mudar a escolha final. Terminada a enquete, adiciona 25% do voto do Meiaum ao resultado e o que for maior vence a rodada e então
é só clicar no botão acima do clipe para ir para a próxima.
</p>

<p>
Quando as músicas que venceram a primeira parte começarem a se enfrentar não terá mais enquete, fica a critério do Meiaum comentar o que quiser ou assistir um pedaço do clipe, assim a segunda parte será mais dinâmica.
Ao final de cada dia uma categoria terá sua música vencedora e no último dia o programa ja monta a chave da final com as músicas de todas as categorias.
</p>

<p>
Cabe decidir com o Meiaum se o usuário vencedor recebe algum prêmio e qual. É preciso que o sistema gere uma lista no final dos usuários que foram desclassificados com o clipe que escolheram para garantir a transparência.
</p>
</div>
</div>
</div>
<div id="outline-container-org592769a" class="outline-3">
<h3 id="org592769a">joguinho interativo com o chat do teorema do macaco infinito um tempo atrás. [Kizza]</h3>
<div class="outline-text-3" id="text-org592769a">
<details class="code-details"
                 style ="padding: 1em;
                          background-color: #e5f5e5;
                          border-radius: 15px;
                          color: hsl(157 75%);
                          font-size: 0.9em;
                          box-shadow: 0.05em 0.1em 5px 0.01em  #00000057;">
                  <summary>
                    <strong>
                      <font face="Courier" size="3" color="#515151">
                         TLDR
                      </font>
                    </strong>
                  </summary>
<p>
o chat vai falando, o macaco pode ou não escolher um comentário, e se escolher vai escolher uma letra aleatória do comentário, e se for a próxima adiciona no texto
</p>


</details>

<p>
A ideia é o liver escolher um texto e o texto ir sendo escrito aleatoriamente por um macaco. O pograminha lê todas as mensagens do chat e pra cada uma:
</p>

<ul class="org-ul">
<li>Joga um d100 pra aquela mensagem</li>
<li>Se o valor for menor que uma porcentagem estipulada, a mensagem é ignorada</li>
<li>Se a mensagem não for ignorada, é escolhido <b>apenas</b> um carácter da mensagem</li>
<li>Se o carácter for o proximo a ser escrito, então ele é escrito, caso contrario nada acontece</li>
</ul>
</div>
</div>
<div id="outline-container-org241810e" class="outline-3">
<h3 id="org241810e">linha do tempo [luscano]</h3>
<div class="outline-text-3" id="text-org241810e">
<details class="code-details"
                 style ="padding: 1em;
                          background-color: #e5f5e5;
                          border-radius: 15px;
                          color: hsl(157 75%);
                          font-size: 0.9em;
                          box-shadow: 0.05em 0.1em 5px 0.01em  #00000057;">
                  <summary>
                    <strong>
                      <font face="Courier" size="3" color="#515151">
                         TLDR
                      </font>
                    </strong>
                  </summary>
<p>
acho que não precisa né?
</p>


</details>

<ul class="org-ul">
<li>[luscano] que tal fazer uma linha do tempo da subathon? tipo, com clipes, doações grandes ou engraçadas, etc?</li>
<li>[sekva] a gente ir rolando pra baixo e vai passando pelos acontecimentos</li>
</ul>
</div>
</div>
<div id="outline-container-org5f2f34a" class="outline-3">
<h3 id="org5f2f34a">bot do firstMuliro [Kizza]</h3>
<div class="outline-text-3" id="text-org5f2f34a">
<p>
bot q quando a pessoa digita &ldquo;quantos dias&rdquo; ou qualquer pergunta facilmente respondida pelo titulo da live (ou qualquer outra informação conhecida), o bot responde com o titulo da live e um link pra uma aula de alfabetização do maternal
</p>
</div>
</div>
<div id="outline-container-orgf3afea1" class="outline-3">
<h3 id="orgf3afea1">coisas que acho que não rola</h3>
<div class="outline-text-3" id="text-orgf3afea1">
<ul class="org-ul">
<li>um jogo dos pererecos [meep087]</li>
<li>o novo twitter [eunael]</li>
<li>um site q marca cada vez q o meiaum fala é duro [Neptune1516]</li>
<li>coisas com IA [sekva]</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org435d1bf" class="outline-2">
<h2 id="org435d1bf">agradecimentos</h2>
<div class="outline-text-2" id="text-org435d1bf">
<ul class="org-ul">
<li>💜 davi que disponibilizou a api do timer pra nois</li>
</ul>
</div>
</div>
<div id="outline-container-orgd051153" class="outline-2">
<h2 id="orgd051153">sites dos nossos devs</h2>
<div class="outline-text-2" id="text-orgd051153">
<ul class="org-ul">
<li><a href="https://justdavi.dev/">davi</a></li>
<li><a href="https://github.com/jho-on/">jho__<sub>on</sub></a></li>
<li><a href="https://www.lexpdev.xyz/">Lexpdev(luscano)</a></li>
<li><a href="https://eufizumacoisa.top/">EuFizUmaCoisa</a></li>
<li><a href="https://sekva.lol/">sekva</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-08-05 seg 10:29</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
